_org/books/index.org
#+TITLE: What I'm reading
#+AUTHOR: Adam Schwartz
#+DATE: June 2, 2022
#+OPTIONS: html-postamble:"<p>Last&nbsp;updated:&nbsp;%C</p>"
#+HTML_HEAD: <link rel="stylesheet" href="../css/style.css" />

* Up Next
1. /Being and Nothingness/
   - Jean-Paul Sartre
2. /Either/Or/
   - Søren Kierkegaard

* 2023
** February 2023
1. Accelerate: The Science of Lean Software and DevOps: Building and Scaling High Performing Technology Organizations
   - Nicole Forsgren, Jez Humble, and Gene Kim

* 2022
** September 2022
1. /The Soul of a New Machine/
   - Tracy Kidder
   - audiobook

** August 2022
1. /The Second Sex/
   - Simone de Beauvoir
   - audiobook

** July 2022
1. Beyond Good and Evil
   - Friedrich Nietzsche, translated by Walter Kaufmann
   - [[file:Beyond-Good-and-Evil.pdf][bookmarks]]

** June 2022
1. The Birth of Tragedy
   - Friedrich Nietzsche, translated by Walter Kaufmann
   - [[file:The-Birth-of-Tragedy.pdf][bookmarks]]

** May 2022
1. The methodology of scientific research programmes
   - Imre Lakatos
   - [[file:The-methodology-of-scientific-research-programmes.pdf][bookmarks]]

** November 2021 - April 2022
1. On the Genealogy of Morals and Ecce Homo
   - Friedrich Nietzsche, translated by Walter Kaufmann and RJ Hollingdale
   - [[file:On-the-Genealogy-of-Morals-and-Ecce-Homo.pdf][bookmarks]]

* 2021
** November 2021
1. Start with Why
   - Simon Sinek

** October 2021
1. The Making of a Counter Culture: Reflections on the Technocratic Society and Its Youthful Opposition
   - Theodore Roszak
   - [[file:The-Making-of-a-Counter-Culture.pdf][bookmarks]]

** September 2021
1. Philosophy in the Tragic Age of the Greeks
   - Friedrich Nietzsche

** March 2021
1. Shape Up
   - Ryan Singer
2. REWORK
   - Jason Fried & David Heinemeier Hansson

* 2020
** September 2019 - February 2020
1. Four Existential Theologians
   - Will Herberg

* 2019
** September 2019
1. The Work of Art in the Age of Mechanical Reproduction
   - Walter Benjamin
2. Ceramic Design
   - John B. Kenny

** March 2019
1. Wittgenstein's Poker
   - David Edmonds & John Eidinow

* 2018
** May 2018
1. Art/Work: Everything You Need to Know (and Do) As You Pursue Your Art Career
   - Heather Darcy Bhandari & Jonathan Melber

** March - June
1. Ethics, Treatise on the Emendation of the Intellect and Selected Letters
   - Baruch Spinoza

** February 2018
1. The Structure of Scientific Revolutions
   - Thomas S. Kuhn
2. How to Talk About Books You Haven’t Read
   - Pierre Bayard

** January 2018
1. Discourse on Method and Meditations on First Philosophy
   - René Descartes

* 2017
** November 2017
1. Farewell to Reason
   - Paul Feyerabend

** October 2017
1. Billy Budd, Sailor
   - Herman Melville

** September 2017
1. Politics
   - Aristotle, translated by Benjamin Jowett
2. The Social Contract: Or Principles Of Political Right
   - Jean Jacques Rousseau, translated by G. D. H. Cole

** August 2017
1. Philosophy Of Law: A Very Short Introduction
   - Raymond Wacks

** April 2017
1. The Grounding for the Metaphysics of Morals
   - Immanuel Kant, translated by James W. Ellington
2. Philosophical Investigations into the Essence of Human Freedom
   - F. W. J. Schelling

** January - March 2017
1. Critique of Pure Reason
   - Immanuel Kant, translated by Werner S. Pluhar
2. The Phenomenology of Spirit
   - G. W. F. Hegel, translated by A. V. Miller and J. N. Findlay

* 2016
** November 2016
1. Ubik
   - Philip K. Dick

** August - October 2016
1. The Trial and Execution of Socrates: Sources and Controversies
   - Thomas C. Brickhouse & Nicholas D. Smith
     1. The Clouds - Aristophanes
     2. The Euthyphro - Plato
     3. The Apology of Socrates - Plato
     4. The Crito - Plato
     5. The Phaedo - Plato
     6. The Apology of Socrates - Xenophon
     7. Memorabilia - Xenophon

** June 2016
1. Cat's Cradle
   - Kurt Vonnegut
2. Style: Toward Clarity and Grace
   - Joseph M. Williams
3. Against Method
   - Paul Feyerabend

** January 2016
1. Orientalism
   - Edward W. Said

* 2015
** December 2015
1. A Clockwork Orange
   - Anthony Burgess

** November 2015
1. What Makes You Not a Buddhist
   - Dzongsar Jamyang Khyentse
2. Fahrenheit 451
   - Ray Bradbury

** September 2015
1. My Land and My People
   - /His Holiness the Dalai Lama/
2. The Meaning of Life
   - /His Holiness the Dalai Lama/

** August 2015
1. Siddhartha
   - Hermann Hesse, translated by Hilda Rosner
2. Brave New World
   - Aldous Huxley

** July 2015
1. Hackers & Painters
   - Paul Graham

** April - May 2015
1. Crypto: How the Code Rebels Beat the Government—Saving Privacy in the Digital Age
   - Steven Levy

** March 2015
1. The Dark Haired Girl
   - Philip K. Dick
2. The Mythical Man-Month
   - Fred Brooks

** February 2015
1. The Republic
   - Plato

* 2014
** November 2014
1. The Cathedral and the Bazaar
   - Essay by Eric S. Raymond
2. The Icarus Deception: How High Will You Fly?
   - Seth Godin

** September 2014
1. "What Do You Care What Other People Think?": Further Adventures of a Curious Character
   - Richard P. Feynman
2. The Meaning of It All: Thoughts of a Citizen-Scientist
   - Richard P. Feynman

** August 2014
1. Colleges That Change Lives: 40 Schools That Will Change the Way You Think About Colleges
   - Loren Pope
2. Americanah
   - Chimamanda Ngozi Adichie
3. Animal Farm
   - George Orwell
4. Nineteen Eighty-Four
   - George Orwell
5. The Salmon of Doubt
   - Douglas Adams
6. Surely You're Joking, Mr. Feynman! (Adventures of a Curious Character)
   - Richard P. Feynman

** January - May 2014
1. The Art of War
   - Sun Tzu
2. The Google Way: How One Company is Revolutionizing Management As We Know It
   - Bernard Girard

* 2013
1. How to Read a Book
   - Mortimer J. Adler and Charles Van Doren
2. Oedipus Rex
   - Sophocles, translated by Dudley Fitts and Robert Fitzgerald
3. Antigone
   - Sophocles, translated by Dudley Fitts and Robert Fitzgerald
4. Civilization and its Discontents
   - Sigmund Freud
5. Man's Search For Meaning
   - Viktor E. Frankl
6. Steve Jobs
   - Walter Isaacson

* Programming & Computer Science

** 2023
1. Sustainable Web Development with Ruby on Rails
   -  David Bryant Copeland

** 2021
1. Elixir in Action
   - Saša Jurić

** 2019
1. Site Reliability Engineering
   - Betsy Beyer, Chris Jones, Jennifer Petoff, and Niall Murphy

** 2018
1. Practical Common Lisp
   - Peter Seibel
2. The Rust Programming Language
   - Steve Klabnik & Carol Nichols
3. The Go Programming Language
   - Alan A. A. Donovan & Brian W. Kernighan

** 2017
1. Computer Networks
   - Andrew S. Tanenbaum

** 2015
1. The TeXbook
   - Donald Knuth
2. Structure and Interpretation of Computer Programs
   - Harold Abelson, Gerald Jay Sussman, and Julie Sussman

** 2014
1. The Little Schemer
   - Daniel P. Friedman & Matthias Felleisen
