books/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What I'm reading</title>
<meta name="author" content="Adam Schwartz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../css/style.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">What I&rsquo;m reading</h1>

<div id="outline-container-orgc31c083" class="outline-2">
<h2 id="orgc31c083">Up Next</h2>
<div class="outline-text-2" id="text-orgc31c083">
<ol class="org-ol">
<li><i>Being and Nothingness</i>
<ul class="org-ul">
<li>Jean-Paul Sartre</li>
</ul></li>
<li><i>Either/Or</i>
<ul class="org-ul">
<li>Søren Kierkegaard</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3c19853" class="outline-2">
<h2 id="org3c19853">2023</h2>
<div class="outline-text-2" id="text-org3c19853">
</div>
<div id="outline-container-orgf5bb70e" class="outline-3">
<h3 id="orgf5bb70e">February 2023</h3>
<div class="outline-text-3" id="text-orgf5bb70e">
<ol class="org-ol">
<li>Accelerate: The Science of Lean Software and DevOps: Building and Scaling High Performing Technology Organizations
<ul class="org-ul">
<li>Nicole Forsgren, Jez Humble, and Gene Kim</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9fdab8d" class="outline-2">
<h2 id="org9fdab8d">2022</h2>
<div class="outline-text-2" id="text-org9fdab8d">
</div>
<div id="outline-container-org939ba8c" class="outline-3">
<h3 id="org939ba8c">September 2022</h3>
<div class="outline-text-3" id="text-org939ba8c">
<ol class="org-ol">
<li><i>The Soul of a New Machine</i>
<ul class="org-ul">
<li>Tracy Kidder</li>
<li>audiobook</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org96be3b2" class="outline-3">
<h3 id="org96be3b2">August 2022</h3>
<div class="outline-text-3" id="text-org96be3b2">
<ol class="org-ol">
<li><i>The Second Sex</i>
<ul class="org-ul">
<li>Simone de Beauvoir</li>
<li>audiobook</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3d0991b" class="outline-3">
<h3 id="org3d0991b">July 2022</h3>
<div class="outline-text-3" id="text-org3d0991b">
<ol class="org-ol">
<li>Beyond Good and Evil
<ul class="org-ul">
<li>Friedrich Nietzsche, translated by Walter Kaufmann</li>
<li><a href="Beyond-Good-and-Evil.pdf">bookmarks</a></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org692f418" class="outline-3">
<h3 id="org692f418">June 2022</h3>
<div class="outline-text-3" id="text-org692f418">
<ol class="org-ol">
<li>The Birth of Tragedy
<ul class="org-ul">
<li>Friedrich Nietzsche, translated by Walter Kaufmann</li>
<li><a href="The-Birth-of-Tragedy.pdf">bookmarks</a></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org513407f" class="outline-3">
<h3 id="org513407f">May 2022</h3>
<div class="outline-text-3" id="text-org513407f">
<ol class="org-ol">
<li>The methodology of scientific research programmes
<ul class="org-ul">
<li>Imre Lakatos</li>
<li><a href="The-methodology-of-scientific-research-programmes.pdf">bookmarks</a></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgea4e99c" class="outline-3">
<h3 id="orgea4e99c">November 2021 - April 2022</h3>
<div class="outline-text-3" id="text-orgea4e99c">
<ol class="org-ol">
<li>On the Genealogy of Morals and Ecce Homo
<ul class="org-ul">
<li>Friedrich Nietzsche, translated by Walter Kaufmann and RJ Hollingdale</li>
<li><a href="On-the-Genealogy-of-Morals-and-Ecce-Homo.pdf">bookmarks</a></li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0c04638" class="outline-2">
<h2 id="org0c04638">2021</h2>
<div class="outline-text-2" id="text-org0c04638">
</div>
<div id="outline-container-org6d0966c" class="outline-3">
<h3 id="org6d0966c">November 2021</h3>
<div class="outline-text-3" id="text-org6d0966c">
<ol class="org-ol">
<li>Start with Why
<ul class="org-ul">
<li>Simon Sinek</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org8a770ab" class="outline-3">
<h3 id="org8a770ab">October 2021</h3>
<div class="outline-text-3" id="text-org8a770ab">
<ol class="org-ol">
<li>The Making of a Counter Culture: Reflections on the Technocratic Society and Its Youthful Opposition
<ul class="org-ul">
<li>Theodore Roszak</li>
<li><a href="The-Making-of-a-Counter-Culture.pdf">bookmarks</a></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org5af2753" class="outline-3">
<h3 id="org5af2753">September 2021</h3>
<div class="outline-text-3" id="text-org5af2753">
<ol class="org-ol">
<li>Philosophy in the Tragic Age of the Greeks
<ul class="org-ul">
<li>Friedrich Nietzsche</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orga93f2d3" class="outline-3">
<h3 id="orga93f2d3">March 2021</h3>
<div class="outline-text-3" id="text-orga93f2d3">
<ol class="org-ol">
<li>Shape Up
<ul class="org-ul">
<li>Ryan Singer</li>
</ul></li>
<li>REWORK
<ul class="org-ul">
<li>Jason Fried &amp; David Heinemeier Hansson</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org01bd7f3" class="outline-2">
<h2 id="org01bd7f3">2020</h2>
<div class="outline-text-2" id="text-org01bd7f3">
</div>
<div id="outline-container-org6cec072" class="outline-3">
<h3 id="org6cec072">September 2019 - February 2020</h3>
<div class="outline-text-3" id="text-org6cec072">
<ol class="org-ol">
<li>Four Existential Theologians
<ul class="org-ul">
<li>Will Herberg</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org87494a5" class="outline-2">
<h2 id="org87494a5">2019</h2>
<div class="outline-text-2" id="text-org87494a5">
</div>
<div id="outline-container-orga67f8f9" class="outline-3">
<h3 id="orga67f8f9">September 2019</h3>
<div class="outline-text-3" id="text-orga67f8f9">
<ol class="org-ol">
<li>The Work of Art in the Age of Mechanical Reproduction
<ul class="org-ul">
<li>Walter Benjamin</li>
</ul></li>
<li>Ceramic Design
<ul class="org-ul">
<li>John B. Kenny</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org92fcb7d" class="outline-3">
<h3 id="org92fcb7d">March 2019</h3>
<div class="outline-text-3" id="text-org92fcb7d">
<ol class="org-ol">
<li>Wittgenstein&rsquo;s Poker
<ul class="org-ul">
<li>David Edmonds &amp; John Eidinow</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org466c128" class="outline-2">
<h2 id="org466c128">2018</h2>
<div class="outline-text-2" id="text-org466c128">
</div>
<div id="outline-container-orgf6a1dc3" class="outline-3">
<h3 id="orgf6a1dc3">May 2018</h3>
<div class="outline-text-3" id="text-orgf6a1dc3">
<ol class="org-ol">
<li>Art/Work: Everything You Need to Know (and Do) As You Pursue Your Art Career
<ul class="org-ul">
<li>Heather Darcy Bhandari &amp; Jonathan Melber</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3a4b615" class="outline-3">
<h3 id="org3a4b615">March - June</h3>
<div class="outline-text-3" id="text-org3a4b615">
<ol class="org-ol">
<li>Ethics, Treatise on the Emendation of the Intellect and Selected Letters
<ul class="org-ul">
<li>Baruch Spinoza</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3f6eb8e" class="outline-3">
<h3 id="org3f6eb8e">February 2018</h3>
<div class="outline-text-3" id="text-org3f6eb8e">
<ol class="org-ol">
<li>The Structure of Scientific Revolutions
<ul class="org-ul">
<li>Thomas S. Kuhn</li>
</ul></li>
<li>How to Talk About Books You Haven’t Read
<ul class="org-ul">
<li>Pierre Bayard</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge0a4329" class="outline-3">
<h3 id="orge0a4329">January 2018</h3>
<div class="outline-text-3" id="text-orge0a4329">
<ol class="org-ol">
<li>Discourse on Method and Meditations on First Philosophy
<ul class="org-ul">
<li>René Descartes</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgdac1c04" class="outline-2">
<h2 id="orgdac1c04">2017</h2>
<div class="outline-text-2" id="text-orgdac1c04">
</div>
<div id="outline-container-org78c2776" class="outline-3">
<h3 id="org78c2776">November 2017</h3>
<div class="outline-text-3" id="text-org78c2776">
<ol class="org-ol">
<li>Farewell to Reason
<ul class="org-ul">
<li>Paul Feyerabend</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orga4193f6" class="outline-3">
<h3 id="orga4193f6">October 2017</h3>
<div class="outline-text-3" id="text-orga4193f6">
<ol class="org-ol">
<li>Billy Budd, Sailor
<ul class="org-ul">
<li>Herman Melville</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgc512613" class="outline-3">
<h3 id="orgc512613">September 2017</h3>
<div class="outline-text-3" id="text-orgc512613">
<ol class="org-ol">
<li>Politics
<ul class="org-ul">
<li>Aristotle, translated by Benjamin Jowett</li>
</ul></li>
<li>The Social Contract: Or Principles Of Political Right
<ul class="org-ul">
<li>Jean Jacques Rousseau, translated by G. D. H. Cole</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org819b7de" class="outline-3">
<h3 id="org819b7de">August 2017</h3>
<div class="outline-text-3" id="text-org819b7de">
<ol class="org-ol">
<li>Philosophy Of Law: A Very Short Introduction
<ul class="org-ul">
<li>Raymond Wacks</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org38da39f" class="outline-3">
<h3 id="org38da39f">April 2017</h3>
<div class="outline-text-3" id="text-org38da39f">
<ol class="org-ol">
<li>The Grounding for the Metaphysics of Morals
<ul class="org-ul">
<li>Immanuel Kant, translated by James W. Ellington</li>
</ul></li>
<li>Philosophical Investigations into the Essence of Human Freedom
<ul class="org-ul">
<li>F. W. J. Schelling</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3bff2fc" class="outline-3">
<h3 id="org3bff2fc">January - March 2017</h3>
<div class="outline-text-3" id="text-org3bff2fc">
<ol class="org-ol">
<li>Critique of Pure Reason
<ul class="org-ul">
<li>Immanuel Kant, translated by Werner S. Pluhar</li>
</ul></li>
<li>The Phenomenology of Spirit
<ul class="org-ul">
<li>G. W. F. Hegel, translated by A. V. Miller and J. N. Findlay</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org6b04e0b" class="outline-2">
<h2 id="org6b04e0b">2016</h2>
<div class="outline-text-2" id="text-org6b04e0b">
</div>
<div id="outline-container-orgfc637c5" class="outline-3">
<h3 id="orgfc637c5">November 2016</h3>
<div class="outline-text-3" id="text-orgfc637c5">
<ol class="org-ol">
<li>Ubik
<ul class="org-ul">
<li>Philip K. Dick</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orga151eb1" class="outline-3">
<h3 id="orga151eb1">August - October 2016</h3>
<div class="outline-text-3" id="text-orga151eb1">
<ol class="org-ol">
<li>The Trial and Execution of Socrates: Sources and Controversies
<ul class="org-ul">
<li>Thomas C. Brickhouse &amp; Nicholas D. Smith
<ol class="org-ol">
<li>The Clouds - Aristophanes</li>
<li>The Euthyphro - Plato</li>
<li>The Apology of Socrates - Plato</li>
<li>The Crito - Plato</li>
<li>The Phaedo - Plato</li>
<li>The Apology of Socrates - Xenophon</li>
<li>Memorabilia - Xenophon</li>
</ol></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org47e42b0" class="outline-3">
<h3 id="org47e42b0">June 2016</h3>
<div class="outline-text-3" id="text-org47e42b0">
<ol class="org-ol">
<li>Cat&rsquo;s Cradle
<ul class="org-ul">
<li>Kurt Vonnegut</li>
</ul></li>
<li>Style: Toward Clarity and Grace
<ul class="org-ul">
<li>Joseph M. Williams</li>
</ul></li>
<li>Against Method
<ul class="org-ul">
<li>Paul Feyerabend</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgbad3e97" class="outline-3">
<h3 id="orgbad3e97">January 2016</h3>
<div class="outline-text-3" id="text-orgbad3e97">
<ol class="org-ol">
<li>Orientalism
<ul class="org-ul">
<li>Edward W. Said</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org5ac7853" class="outline-2">
<h2 id="org5ac7853">2015</h2>
<div class="outline-text-2" id="text-org5ac7853">
</div>
<div id="outline-container-orgc0006fb" class="outline-3">
<h3 id="orgc0006fb">December 2015</h3>
<div class="outline-text-3" id="text-orgc0006fb">
<ol class="org-ol">
<li>A Clockwork Orange
<ul class="org-ul">
<li>Anthony Burgess</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org822036c" class="outline-3">
<h3 id="org822036c">November 2015</h3>
<div class="outline-text-3" id="text-org822036c">
<ol class="org-ol">
<li>What Makes You Not a Buddhist
<ul class="org-ul">
<li>Dzongsar Jamyang Khyentse</li>
</ul></li>
<li>Fahrenheit 451
<ul class="org-ul">
<li>Ray Bradbury</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf247098" class="outline-3">
<h3 id="orgf247098">September 2015</h3>
<div class="outline-text-3" id="text-orgf247098">
<ol class="org-ol">
<li>My Land and My People
<ul class="org-ul">
<li><i>His Holiness the Dalai Lama</i></li>
</ul></li>
<li>The Meaning of Life
<ul class="org-ul">
<li><i>His Holiness the Dalai Lama</i></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgeb65479" class="outline-3">
<h3 id="orgeb65479">August 2015</h3>
<div class="outline-text-3" id="text-orgeb65479">
<ol class="org-ol">
<li>Siddhartha
<ul class="org-ul">
<li>Hermann Hesse, translated by Hilda Rosner</li>
</ul></li>
<li>Brave New World
<ul class="org-ul">
<li>Aldous Huxley</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgbcc7788" class="outline-3">
<h3 id="orgbcc7788">July 2015</h3>
<div class="outline-text-3" id="text-orgbcc7788">
<ol class="org-ol">
<li>Hackers &amp; Painters
<ul class="org-ul">
<li>Paul Graham</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgecd874a" class="outline-3">
<h3 id="orgecd874a">April - May 2015</h3>
<div class="outline-text-3" id="text-orgecd874a">
<ol class="org-ol">
<li>Crypto: How the Code Rebels Beat the Government—Saving Privacy in the Digital Age
<ul class="org-ul">
<li>Steven Levy</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgee7e026" class="outline-3">
<h3 id="orgee7e026">March 2015</h3>
<div class="outline-text-3" id="text-orgee7e026">
<ol class="org-ol">
<li>The Dark Haired Girl
<ul class="org-ul">
<li>Philip K. Dick</li>
</ul></li>
<li>The Mythical Man-Month
<ul class="org-ul">
<li>Fred Brooks</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org0e009c7" class="outline-3">
<h3 id="org0e009c7">February 2015</h3>
<div class="outline-text-3" id="text-org0e009c7">
<ol class="org-ol">
<li>The Republic
<ul class="org-ul">
<li>Plato</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org14ae385" class="outline-2">
<h2 id="org14ae385">2014</h2>
<div class="outline-text-2" id="text-org14ae385">
</div>
<div id="outline-container-org32fb5b1" class="outline-3">
<h3 id="org32fb5b1">November 2014</h3>
<div class="outline-text-3" id="text-org32fb5b1">
<ol class="org-ol">
<li>The Cathedral and the Bazaar
<ul class="org-ul">
<li>Essay by Eric S. Raymond</li>
</ul></li>
<li>The Icarus Deception: How High Will You Fly?
<ul class="org-ul">
<li>Seth Godin</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org89d30df" class="outline-3">
<h3 id="org89d30df">September 2014</h3>
<div class="outline-text-3" id="text-org89d30df">
<ol class="org-ol">
<li>&ldquo;What Do You Care What Other People Think?&rdquo;: Further Adventures of a Curious Character
<ul class="org-ul">
<li>Richard P. Feynman</li>
</ul></li>
<li>The Meaning of It All: Thoughts of a Citizen-Scientist
<ul class="org-ul">
<li>Richard P. Feynman</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf40e7ba" class="outline-3">
<h3 id="orgf40e7ba">August 2014</h3>
<div class="outline-text-3" id="text-orgf40e7ba">
<ol class="org-ol">
<li>Colleges That Change Lives: 40 Schools That Will Change the Way You Think About Colleges
<ul class="org-ul">
<li>Loren Pope</li>
</ul></li>
<li>Americanah
<ul class="org-ul">
<li>Chimamanda Ngozi Adichie</li>
</ul></li>
<li>Animal Farm
<ul class="org-ul">
<li>George Orwell</li>
</ul></li>
<li>Nineteen Eighty-Four
<ul class="org-ul">
<li>George Orwell</li>
</ul></li>
<li>The Salmon of Doubt
<ul class="org-ul">
<li>Douglas Adams</li>
</ul></li>
<li>Surely You&rsquo;re Joking, Mr. Feynman! (Adventures of a Curious Character)
<ul class="org-ul">
<li>Richard P. Feynman</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org2589d55" class="outline-3">
<h3 id="org2589d55">January - May 2014</h3>
<div class="outline-text-3" id="text-org2589d55">
<ol class="org-ol">
<li>The Art of War
<ul class="org-ul">
<li>Sun Tzu</li>
</ul></li>
<li>The Google Way: How One Company is Revolutionizing Management As We Know It
<ul class="org-ul">
<li>Bernard Girard</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgca2d77e" class="outline-2">
<h2 id="orgca2d77e">2013</h2>
<div class="outline-text-2" id="text-orgca2d77e">
<ol class="org-ol">
<li>How to Read a Book
<ul class="org-ul">
<li>Mortimer J. Adler and Charles Van Doren</li>
</ul></li>
<li>Oedipus Rex
<ul class="org-ul">
<li>Sophocles, translated by Dudley Fitts and Robert Fitzgerald</li>
</ul></li>
<li>Antigone
<ul class="org-ul">
<li>Sophocles, translated by Dudley Fitts and Robert Fitzgerald</li>
</ul></li>
<li>Civilization and its Discontents
<ul class="org-ul">
<li>Sigmund Freud</li>
</ul></li>
<li>Man&rsquo;s Search For Meaning
<ul class="org-ul">
<li>Viktor E. Frankl</li>
</ul></li>
<li>Steve Jobs
<ul class="org-ul">
<li>Walter Isaacson</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge4db357" class="outline-2">
<h2 id="orge4db357">Programming &amp; Computer Science</h2>
<div class="outline-text-2" id="text-orge4db357">
</div>
<div id="outline-container-org871fec2" class="outline-3">
<h3 id="org871fec2">2023</h3>
<div class="outline-text-3" id="text-org871fec2">
<ol class="org-ol">
<li>Sustainable Web Development with Ruby on Rails
<ul class="org-ul">
<li>David Bryant Copeland</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3d69033" class="outline-3">
<h3 id="org3d69033">2021</h3>
<div class="outline-text-3" id="text-org3d69033">
<ol class="org-ol">
<li>Elixir in Action
<ul class="org-ul">
<li>Saša Jurić</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orga6cfc8f" class="outline-3">
<h3 id="orga6cfc8f">2019</h3>
<div class="outline-text-3" id="text-orga6cfc8f">
<ol class="org-ol">
<li>Site Reliability Engineering
<ul class="org-ul">
<li>Betsy Beyer, Chris Jones, Jennifer Petoff, and Niall Murphy</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org1c28246" class="outline-3">
<h3 id="org1c28246">2018</h3>
<div class="outline-text-3" id="text-org1c28246">
<ol class="org-ol">
<li>Practical Common Lisp
<ul class="org-ul">
<li>Peter Seibel</li>
</ul></li>
<li>The Rust Programming Language
<ul class="org-ul">
<li>Steve Klabnik &amp; Carol Nichols</li>
</ul></li>
<li>The Go Programming Language
<ul class="org-ul">
<li>Alan A. A. Donovan &amp; Brian W. Kernighan</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgca2655b" class="outline-3">
<h3 id="orgca2655b">2017</h3>
<div class="outline-text-3" id="text-orgca2655b">
<ol class="org-ol">
<li>Computer Networks
<ul class="org-ul">
<li>Andrew S. Tanenbaum</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgb0b683d" class="outline-3">
<h3 id="orgb0b683d">2015</h3>
<div class="outline-text-3" id="text-orgb0b683d">
<ol class="org-ol">
<li>The TeXbook
<ul class="org-ul">
<li>Donald Knuth</li>
</ul></li>
<li>Structure and Interpretation of Computer Programs
<ul class="org-ul">
<li>Harold Abelson, Gerald Jay Sussman, and Julie Sussman</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgdd4dfb0" class="outline-3">
<h3 id="orgdd4dfb0">2014</h3>
<div class="outline-text-3" id="text-orgdd4dfb0">
<ol class="org-ol">
<li>The Little Schemer
<ul class="org-ul">
<li>Daniel P. Friedman &amp; Matthias Felleisen</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last&nbsp;updated:&nbsp;2023-02-10</p>
</div>
</body>
</html>
